org/2014-11-25-shell.org
#+TITLE: Shell & Tools
#+HTML_HEAD: <link rel="stylesheet" type="text/css" href="/css/worg.css" />
#+OPTIONS: ^:{}
#+STARTUP: indent

* shell program

* awk
+ 以awk文件方式运行, -f
#+begin_src awk
#!/bin/awk
{print $0}
#+end_src
#+begin_src sh
awk -f strcat.awk if.sh
#+end_src
+ 字符串连接 a ("" | "+") b
+ print printf
#+begin_src sh
{print $0}
{printf("%04d %s", NR, $0)} 
#+end_src
+ -v 可带输入变量
#+begin_src sh
awk -v num=10 '{print num}'
#+end_src
+ 关联数组
#+begin_src awk
#!/bin/awk
#word count
BEGIN {
	FS="[^a-zA-Z]"
}
{
	for(i=1; i<=NF; i++)
		words[tolower($i)]++;
}
END {
	delete words[""]
	for (x in words)
		print x, words[x];
}
#+end_src
+ getline close(在脚本中要两次读取同一文件时要close)
#+begin_src sh
#将拼音级的抄本查表转换成音素级抄本
#!/bin/bash

if [ $# -ne 2 ]; then
	echo "Usage: pinyin2phone.sh dict_file pinyin2phone"
	exit -1
fi

dict=$1
awk -v phone_map=$2 \
'BEGIN {
	while (getline < phone_map) {
		t = "";
		for (i=2; i<=NF; i++)
			t = t " " $i;
		map[$1] = t;
		#print $1, t
	}
    close(phone_map) #此处也可以不写
}
{
	line = $1;
	for (i=2; i<=NF; i++)
		line = line " " map[$i];
	print line;
}
' $dict 
#+end_src
+ 字符串处理函数
#+begin_example
gsub(r,s)    在整个$0中用s替代r
gsub(r,s,t)    在整个t中用s替代r
index(s,t)    返回s中字符串t的第一位置
length(s)    返回s长度
match(s,r)    测试s是否包含匹配r的字符串
split(s,a,fs)    在fs上将s分成序列a
sprint(fmt,exp)    返回经fmt格式化后的exp
sub(r,s)    用$0中最左边最长的子串代替s
substr(s,p)    返回字符串s中从p开始的后缀部分
substr(s,p,n)    返回字符串s中从p开始长度为n的后缀部分
#+end_example
#+begin_src sh
#仅仅使用begin在shell中格式化字符串
awk x=10 'BEGIN{printf("S%04d", x)}
awk 'BEGIN{print split("123#456#678", myarray, "#")}'
awk '{BEGIN {print match("ANCD", /d/)}'
#+end_src
+ system,调用shell命令
#+begin_src sh
#function system(expr) uses /bin/sh to execute expr and returns the exit status of the command expr.
#假设文件file中每一行均为文件名，cat所有文件
$ awk '{system("cat" " "  $0)}' file
#+end_src
+ *莫给NR，NF加$,经常犯这个错*
* sed
+ -e 连续执行多个编辑
#+begin_src sh
sed -e "s:aa:bb:" -e "s:\d::" file
#+end_src
+ -i 在源文件上进行替换
#+begin_src sh
#如删除windows下文件的^M显示
sed -i 's/^M//g' filename 
#+end_src
+ \(\)表示分组，_1,_2引用，标准正则表达式使用()
#+begin_src sh
#如根据路径取x.wav的文件名
sed "s:.*/\(.*\)\.wav:\1:"
#+end_src
* grep

* cut

* find

