_posts/2014-11-25-shell.html
---
title:  Shell & Tools
---
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>Shell &amp; Tools</title>
<!-- 2014-11-25 二 11:47 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="robin1001" />
<link rel="stylesheet" type="text/css" href="/css/worg.css" />
</head>
<body>
<div id="content">
<h1 class="title">Shell &amp; Tools</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. shell program</a></li>
<li><a href="#sec-2">2. awk</a></li>
<li><a href="#sec-3">3. sed</a></li>
<li><a href="#sec-4">4. grep</a></li>
<li><a href="#sec-5">5. cut</a></li>
<li><a href="#sec-6">6. find</a></li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> shell program</h2>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> awk</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>以awk文件方式运行, -f
</li>
</ul>
<div class="org-src-container">

<pre class="src src-awk"><span style="color: #ee82ee;">#</span><span style="color: #ee82ee;">!/bin/awk</span>
{<span style="color: #ff6347; font-weight: bold;">print</span> $0}
</pre>
</div>
<div class="org-src-container">

<pre class="src src-sh">awk -f strcat.awk if.sh
</pre>
</div>
<ul class="org-ul">
<li>字符串连接 a ("" | "+") b
</li>
<li>print printf
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">{print $<span style="color: #bebebe; font-weight: bold;">0</span>}
{<span style="color: #ffc0cb; font-size: 110%; font-weight: bold;">printf</span>(<span style="color: #ff0000;">"%04d %s"</span>, NR, $<span style="color: #bebebe; font-weight: bold;">0</span>)}
</pre>
</div>
<ul class="org-ul">
<li>-v 可带输入变量
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">awk -v <span style="color: #bebebe; font-weight: bold;">num</span>=10 <span style="color: #ff0000;">'{print num}'</span>
</pre>
</div>
<ul class="org-ul">
<li>关联数组
</li>
</ul>
<div class="org-src-container">

<pre class="src src-awk"><span style="color: #ee82ee;">#</span><span style="color: #ee82ee;">!/bin/awk</span>
<span style="color: #ee82ee;">#</span><span style="color: #ee82ee;">word count</span>
<span style="color: #40e0d0; font-weight: bold;">BEGIN</span> {
    <span style="color: #bebebe; font-weight: bold;">FS</span>=<span style="color: #ff0000;">"[^a-zA-Z]"</span>
}
{
    <span style="color: #40e0d0; font-weight: bold;">for</span>(i=1; i&lt;=<span style="color: #bebebe; font-weight: bold;">NF</span>; i++)
        words[<span style="color: #ff6347; font-weight: bold;">tolower</span>($i)]++;
}
<span style="color: #40e0d0; font-weight: bold;">END</span> {
    <span style="color: #40e0d0; font-weight: bold;">delete</span> words[<span style="color: #ff0000;">""</span>]
    <span style="color: #40e0d0; font-weight: bold;">for</span> (x <span style="color: #40e0d0; font-weight: bold;">in</span> words)
        <span style="color: #ff6347; font-weight: bold;">print</span> x, words[x];
}
</pre>
</div>
<ul class="org-ul">
<li>getline close(在脚本中要两次读取同一文件时要close)
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ee82ee;">#</span><span style="color: #ee82ee;">&#23558;&#25340;&#38899;&#32423;&#30340;&#25220;&#26412;&#26597;&#34920;&#36716;&#25442;&#25104;&#38899;&#32032;&#32423;&#25220;&#26412;</span>
<span style="color: #ee82ee;">#</span><span style="color: #ee82ee;">!/bin/bash</span>

<span style="color: #40e0d0; font-weight: bold;">if</span> [ $<span style="color: #bebebe; font-weight: bold;">#</span> -ne 2 ]; <span style="color: #40e0d0; font-weight: bold;">then</span>
    <span style="color: #ffc0cb; font-size: 110%; font-weight: bold;">echo</span> <span style="color: #ff0000;">"Usage: pinyin2phone.sh dict_file pinyin2phone"</span>
    <span style="color: #40e0d0; font-weight: bold;">exit</span> -1
<span style="color: #40e0d0; font-weight: bold;">fi</span>

<span style="color: #bebebe; font-weight: bold;">dict</span>=$<span style="color: #bebebe; font-weight: bold;">1</span>
awk -v <span style="color: #bebebe; font-weight: bold;">phone_map</span>=$<span style="color: #bebebe; font-weight: bold;">2</span> <span style="color: #ff0000;">\</span>
<span style="color: #ff0000;">'BEGIN {</span>
<span style="color: #ff0000;">    while (getline &lt; phone_map) {</span>
<span style="color: #ff0000;">        t = "";</span>
<span style="color: #ff0000;">        for (i=2; i&lt;=NF; i++)</span>
<span style="color: #ff0000;">            t = t " " $i;</span>
<span style="color: #ff0000;">        map[$1] = t;</span>
<span style="color: #ff0000;">        #print $1, t</span>
<span style="color: #ff0000;">    }</span>
<span style="color: #ff0000;">    close(phone_map) #&#27492;&#22788;&#20063;&#21487;&#20197;&#19981;&#20889;</span>
<span style="color: #ff0000;">}</span>
<span style="color: #ff0000;">{</span>
<span style="color: #ff0000;">    line = $1;</span>
<span style="color: #ff0000;">    for (i=2; i&lt;=NF; i++)</span>
<span style="color: #ff0000;">        line = line " " map[$i];</span>
<span style="color: #ff0000;">    print line;</span>
<span style="color: #ff0000;">}</span>
<span style="color: #ff0000;">'</span> $<span style="color: #bebebe; font-weight: bold;">dict</span>
</pre>
</div>
<ul class="org-ul">
<li>字符串处理函数
</li>
</ul>
<pre class="example">
gsub(r,s)    在整个$0中用s替代r
gsub(r,s,t)    在整个t中用s替代r
index(s,t)    返回s中字符串t的第一位置
length(s)    返回s长度
match(s,r)    测试s是否包含匹配r的字符串
split(s,a,fs)    在fs上将s分成序列a
sprint(fmt,exp)    返回经fmt格式化后的exp
sub(r,s)    用$0中最左边最长的子串代替s
substr(s,p)    返回字符串s中从p开始的后缀部分
substr(s,p,n)    返回字符串s中从p开始长度为n的后缀部分
</pre>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ee82ee;">#</span><span style="color: #ee82ee;">&#20165;&#20165;&#20351;&#29992;begin&#22312;shell&#20013;&#26684;&#24335;&#21270;&#23383;&#31526;&#20018;</span>
awk <span style="color: #bebebe; font-weight: bold;">x</span>=10 <span style="color: #ff0000;">'BEGIN{printf("S%04d", x)}</span>
<span style="color: #ff0000;">awk '</span>BEGIN{print split(<span style="color: #ff0000;">"123#456#678"</span>, myarray, <span style="color: #ff0000;">"#"</span>)}<span style="color: #ff0000;">'</span>
<span style="color: #ff0000;">awk '</span>{BEGIN {print match(<span style="color: #ff0000;">"ANCD"</span>, /d/)}<span style="color: #ff0000;">'</span>
</pre>
</div>
<ul class="org-ul">
<li>system,调用shell命令
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ee82ee;">#</span><span style="color: #ee82ee;">function system(expr) uses /bin/sh to execute expr and returns the exit status of the command expr.</span>
<span style="color: #ee82ee;">#</span><span style="color: #ee82ee;">&#20551;&#35774;&#25991;&#20214;file&#20013;&#27599;&#19968;&#34892;&#22343;&#20026;&#25991;&#20214;&#21517;&#65292;cat&#25152;&#26377;&#25991;&#20214;</span>
$ awk <span style="color: #ff0000;">'{system("cat" " "  $0)}'</span> file
</pre>
</div>
<ul class="org-ul">
<li><b>莫给NR，NF加$,经常犯这个错</b>
</li>
</ul>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> sed</h2>
<div class="outline-text-2" id="text-3">
<ul class="org-ul">
<li>-e 连续执行多个编辑
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh">sed -e <span style="color: #ff0000;">"s:aa:bb:"</span> -e <span style="color: #ff0000;">"s:\d::"</span> file
</pre>
</div>
<ul class="org-ul">
<li>-i 在源文件上进行替换
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ee82ee;">#</span><span style="color: #ee82ee;">&#22914;&#21024;&#38500;windows&#19979;&#25991;&#20214;&#30340;^M&#26174;&#31034;</span>
sed -i <span style="color: #ff0000;">'s/^M//g'</span> filename
</pre>
</div>
<ul class="org-ul">
<li>\(\)表示分组，_1,_2引用，标准正则表达式使用()
</li>
</ul>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #ee82ee;">#</span><span style="color: #ee82ee;">&#22914;&#26681;&#25454;&#36335;&#24452;&#21462;x.wav&#30340;&#25991;&#20214;&#21517;</span>
sed <span style="color: #ff0000;">"s:.*/\(.*\)\.wav:\1:"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> grep</h2>
</div>

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> cut</h2>
</div>

<div id="outline-container-sec-6" class="outline-2">
<h2 id="sec-6"><span class="section-number-2">6</span> find</h2>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: robin1001</p>
<p class="date">Created: 2014-11-25 二 11:47</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.4.1 (<a href="http://orgmode.org">Org</a> mode 8.2.10)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
